In [ ]:
# Grouping of the data

In [3]:
import pandas as pd

name = ['Aayush','Aayush',"Gopal Ji",]
contact= ['123','123',"555",]

data = pd.DataFrame({'Name':name, 'Contact':contact})

data

       Name Contact
0    Aayush     123
1    Aayush     123
2  Gopal Ji     555

In [5]:
grouped = data.groupby('Name')

print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E293E4BB10>

In [6]:
import pandas as pd

multi_data = pd.DataFrame({
    'Park':['A','A','B','B'],
    'Name' : ['Anna','Ben','Chris','Daisy'],
    'Lemonades':[2,3,4,5]
}).set_index(['Park','Name'])

In [7]:
grouped = multi_data.groupby('Name')
grouped.sum()

       Lemonades
Name
Anna           2
Ben            3
Chris          4
Daisy          5

In [10]:
print(grouped['Lemonades'].mean())

Name
Anna     2.0
Ben      3.0
Chris    4.0
Daisy    5.0
Name: Lemonades, dtype: float64

In [11]:
print(grouped['Lemonades'].min())
print()
print(grouped['Lemonades'].max())

Name
Anna     2
Ben      3
Chris    4
Daisy    5
Name: Lemonades, dtype: int64

Name
Anna     2
Ben      3
Chris    4
Daisy    5
Name: Lemonades, dtype: int64

In [ ]:
multi_data.pivot_table(values='Lemonades',index = 'Name')
#the problem is that it does the computation of the means before display

       Lemonades
Name
Anna         2.0
Ben          3.0
Chris        4.0
Daisy        5.0

In [ ]:
# crosstab

pd.crosstab(multi_data.index.get_level_values('Name'), multi_data['Lemonades'])

#you are doing the fetch incase the Name is set as an index.

Lemonades  2  3  4  5
row_0
Anna       1  0  0  0
Ben        0  1  0  0
Chris      0  0  1  0
Daisy      0  0  0  1